In [2]:
import pandas as pd

In [3]:
file_path = r'/workspaces/demo-devcontainer-main/resource/data_with_nan.csv'

df = pd.read_csv(file_path)

df

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
3    NaN   NaN  NaN
4  test5   NaN  bbb
5    NaN   NaN  NaN

In [4]:
df['col3'][0]

nan

In [5]:
type(df['col3'][0])

float

In [6]:
df['col2']

0    13.0
1    44.0
2     NaN
3     NaN
4     NaN
5     NaN
Name: col2, dtype: float64

In [7]:
import numpy as np

In [8]:
np.nan

nan

In [9]:
# Check if values are NaN
df['col1'].isna()

0    False
1    False
2    False
3     True
4    False
5     True
Name: col1, dtype: bool

In [10]:
df[df['col1'].isna()]

  col1  col2 col3
3  NaN   NaN  NaN
5  NaN   NaN  NaN

In [11]:
# 非空值
df['col1'].notna()

0     True
1     True
2     True
3    False
4     True
5    False
Name: col1, dtype: bool

In [12]:
# 加 ~ 即為反義, 不建議使用
df[
    ~(df['col1'].isna())
   ]

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
4  test5   NaN  bbb

In [13]:
# 有空值就被丟掉
df.dropna()

    col1  col2 col3
1  test2  44.0  aaa

In [14]:
# 全部是空值才被丟掉
df.dropna(how='all')

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
4  test5   NaN  bbb

In [15]:
df

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
3    NaN   NaN  NaN
4  test5   NaN  bbb
5    NaN   NaN  NaN

In [16]:
# 空值 >= 2 的丟掉
df.dropna(thresh=2)

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
4  test5   NaN  bbb

In [17]:
# 補空值為 0

df['col2'].fillna(0)

0    13.0
1    44.0
2     0.0
3     0.0
4     0.0
5     0.0
Name: col2, dtype: float64

In [18]:
df['col2_fill_0'] = df['col2'].fillna(0)
df

    col1  col2 col3  col2_fill_0
0  test1  13.0  NaN         13.0
1  test2  44.0  aaa         44.0
2  test3   NaN  NaN          0.0
3    NaN   NaN  NaN          0.0
4  test5   NaN  bbb          0.0
5    NaN   NaN  NaN          0.0

In [19]:
# 空值補為上一筆資料

df['col1'].fillna(method='ffill')

/tmp/ipykernel_76372/2239132731.py:3: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['col1'].fillna(method='ffill')

0    test1
1    test2
2    test3
3    test3
4    test5
5    test5
Name: col1, dtype: object

In [20]:
# FutureWarning: Use obj.ffill() or obj.bfill() instead.
# 原本寫法 df['col1'].fillna(method='ffill')

df['col1'].ffill()

0    test1
1    test2
2    test3
3    test3
4    test5
5    test5
Name: col1, dtype: object

In [21]:
# 空值補為後面一筆的資料
# 第5筆因為沒有下一筆資料, 所以還是空值

df['col3'].bfill()

0    aaa
1    aaa
2    bbb
3    bbb
4    bbb
5    NaN
Name: col3, dtype: object

In [22]:
# 補甚麼直接寫

df['col1'].fillna('Unknown')

0      test1
1      test2
2      test3
3    Unknown
4      test5
5    Unknown
Name: col1, dtype: object